{"text": "Good morning! Here is your daily briefing, curated from your newsletters. Today is Sunday, September 04.\nHere's your first update of the day:\nCondé Nast is offering a limited time subscription to both The New Yorker and Vanity Fair for the low price of $24. This offer includes digital access to both magazines. The New Yorker is known for its in-depth reporting, commentary, fiction, poetry, and humor, while Vanity Fair is a cultural conversation starter, providing high-profile interviews, stunning photography, and thought-provoking features. If you're ever dissatisfied with your subscription, you can receive a full refund on unmailed issues.\nNext up:\nEmre Guler is a B.A. candidate at the University of Pennsylvania, class of 2024. In this newsletter, Emre lists some of their best work.\nNext up:\nThis email is from Jay Sand, a music teacher and Penn alum, who is asking for help teaching a lesson on the Bavarian Schuhplattler dance. He is also offering an internship for the upcoming school year to help young kids around the world embrace diversity.\nNext up:\nThe Wait But Why newsletter sends its subscribers a \"greatest hits\" post every Sunday morning, chosen from the archive of 100-ish posts. This week's post is about email, and how it can be awkward and annoying. If you want to opt out of this series but stay subscribed for new posts, click here.\nAnd here is the final newsletter for the day:\nIt's Friday, and we're starting the weekend off with a feel-good story about a missing dog. In other news, the FBI searched Donald Trump's home for classified documents related to nuclear weapons, the CDC loosened its coronavirus guidelines, and the House is expected to pass Democrats' major economic package today. Plus, the Arctic is warming much faster than scientists expected, a gunman was killed after trying to get into an FBI office in Ohio, and Gen Zers don't want to spend their lives stuck in a cubicle.\nThat's everything for today; thanks for tuning into Newscast!"}