{"text": "Good morning! Here is your daily briefing, curated from your newsletters. Today is Sunday, September 04.\nThe New Yorker and Vanity Fair have joined together and are offering a limited time subscription for both magazines plus digital access for $24. There is no commitment required and you can cancel anytime. The New Yorker is known for in-depth reporting, commentary, fiction, poetry, and humor. Vanity Fair is known to start cultural conversations, providing high-profile interviews, stunning photography, and thought-provoking features.\nThe newsletter contains information about Emre Guler, a student at the University of Pennsylvania. Emre is a candidate for the class of 2024 and is studying for a B.A.\nThe Penn German Society recently received a newsletter from Jay Sand, a music teacher, Penn alum, and West Philly resident, about an internship opportunity with his project, All Around This World. The project is a diversity, equity and inclusion program for young children and their families that encourages kids to explore the world through music, rhythms, and cultural experiences. The internship would be a good fit for students interested in entering careers in education, cultural studies, music/ethnomusicology, marketing and business/entrepreneurship. It would involve collaborating with Jay to identify and communicate with primary/elementary schools in a wide range of countries, offering them access to All Around This World classes and curriculum materials and inviting them to join the All Around This World \"pen pal\" community. Interns will be unpaid, but will play to their strengths, choose their level of participation, and have the opportunity to help this local, mission-driven small business expand the horizons of kids everywhere.\nThe Wait But Why newsletter will be sending out their favorite posts from the archive every Sunday morning. This week's post is about email and how it can be awkward sometimes. If you want to opt out of this series but stay subscribed for new posts, click here.\nThe 7 is a daily newsletter from The Washington Post. This edition includes stories on the FBI's search of Donald Trump's home, the CDC's loosened coronavirus guidelines, and Democrats' major economic package.\nYuh-Line Niou is a state assemblywoman in New York’s 65th District, representing parts of Lower Manhattan since 2017. In an interview, she discusses her career and how she plans to continue fighting for her constituents.\nIn her new BBC radio documentary, The Church of Social Justice, and accompanying Atlantic article, writer Helen Lewis argues that the decline of organized religion is one of the most important trends in postwar history. She argues that, as religion has declined, politics has stepped in to fill both the good and bad bits of religion. This is particularly apparent on the left, where values divides have replaced class politics. Lewis argues that, while social-justice movements offer moments of transcendence and unselfing, they lack a mechanism for confessing, repenting, and being absolved.\nWelcome back to school! The Penn Spark newsletter is here to keep you updated on all the tech and design happenings on campus and beyond. This semester, they're excited to announce their applications for Spark Blue and Spark Red are now live. If you're interested in joining, be sure to apply by September 9th. They'll also be hosting a variety of events, like the Building Your First Game on the Internet Computer workshop and the HackWashU hackathon. As always, if you have any questions or comments, feel free to email them!\nWelcome to the Penn Neuroscience Society's Welcome Weekend! This Friday, September 9th, join us for outdoor games and buy a cup of boba with our board members! Then, on Saturday, participate in our scavenger hunt and enjoy dinner and karaoke at Ken's. Finally, on Sunday, join us for brunch at Bluestone Lane. RSVP soon, spots are limited! You can also learn more about our Research Committee, Journal Committee, and Consulting Committee at our info sessions next week. Hope to see you there!\nThat's everything for today; thanks for tuning into Newscast!"}